Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes
The DimensionFormatAttributes class controls the precision, format and unit of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.Precision
The precision of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.Format
The format of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.Unit
Gets or sets the unit of the dimension. Changing this attribute
does not have any effect if the dimension measures an angle.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.UseDigitGrouping
Gets or sets a value indicating whether digit grouping should be used or not.
The following example shows how the property works:
true: 123 456.789
false: 123456.789

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.#ctor
Creates a new dimension format attributes instance. By default the format rounds the dimension value to
the nearest whole and shows it with no decimals. The unit is selected automatically.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.#ctor(Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions,Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats,Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits)
Creates a new dimension format attributes instance with the given parameters.
precision: The precision of the dimension.
format: The format of the dimension.
unit: The unit of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.